OS-Q/A51/boards.txt
##############################################################
espino.name=ESPino (ESP-12 Module)
espino.build.board=ESP8266_ESP12
espino.build.variant=espino
espino.upload.tool=esptool
espino.upload.maximum_data_size=81920
espino.upload.wait_for_upload_port=true
espino.upload.erase_cmd=
espino.serial.disableDTR=true
espino.serial.disableRTS=true
espino.build.mcu=esp8266
espino.build.core=esp8266
espino.build.spiffs_pagesize=256
espino.build.debug_port=
espino.build.debug_level=
espino.menu.xtal.80=80 MHz
espino.menu.xtal.80.build.f_cpu=80000000L
espino.menu.xtal.160=160 MHz
espino.menu.xtal.160.build.f_cpu=160000000L
espino.menu.vt.flash=Flash
espino.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espino.menu.vt.heap=Heap
espino.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espino.menu.vt.iram=IRAM
espino.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espino.menu.exception.legacy=Legacy (new can return nullptr)
espino.menu.exception.legacy.build.exception_flags=-fno-exceptions
espino.menu.exception.legacy.build.stdcpp_lib=-lstdc++
espino.menu.exception.disabled=Disabled (new can abort)
espino.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
espino.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espino.menu.exception.enabled=Enabled
espino.menu.exception.enabled.build.exception_flags=-fexceptions
espino.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espino.menu.ssl.all=All SSL ciphers (most compatible)
espino.menu.ssl.all.build.sslflags=
espino.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espino.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espino.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
espino.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
espino.menu.ResetMethod.ck=no dtr (aka ck)
espino.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
espino.build.flash_mode=qio
espino.build.flash_flags=-DFLASHMODE_QIO
espino.build.flash_freq=40
espino.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espino.menu.eesz.4M2M.build.flash_size=4M
espino.menu.eesz.4M2M.build.flash_size_bytes=0x400000
espino.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espino.menu.eesz.4M2M.build.spiffs_pagesize=256
espino.menu.eesz.4M2M.upload.maximum_size=1044464
espino.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espino.menu.eesz.4M2M.build.spiffs_start=0x200000
espino.menu.eesz.4M2M.build.spiffs_end=0x3FA000
espino.menu.eesz.4M2M.build.spiffs_blocksize=8192
espino.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espino.menu.eesz.4M3M.build.flash_size=4M
espino.menu.eesz.4M3M.build.flash_size_bytes=0x400000
espino.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espino.menu.eesz.4M3M.build.spiffs_pagesize=256
espino.menu.eesz.4M3M.upload.maximum_size=1044464
espino.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espino.menu.eesz.4M3M.build.spiffs_start=0x100000
espino.menu.eesz.4M3M.build.spiffs_end=0x3FA000
espino.menu.eesz.4M3M.build.spiffs_blocksize=8192
espino.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espino.menu.eesz.4M1M.build.flash_size=4M
espino.menu.eesz.4M1M.build.flash_size_bytes=0x400000
espino.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espino.menu.eesz.4M1M.build.spiffs_pagesize=256
espino.menu.eesz.4M1M.upload.maximum_size=1044464
espino.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espino.menu.eesz.4M1M.build.spiffs_start=0x300000
espino.menu.eesz.4M1M.build.spiffs_end=0x3FA000
espino.menu.eesz.4M1M.build.spiffs_blocksize=8192
espino.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espino.menu.eesz.4M.build.flash_size=4M
espino.menu.eesz.4M.build.flash_size_bytes=0x400000
espino.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espino.menu.eesz.4M.build.spiffs_pagesize=256
espino.menu.eesz.4M.upload.maximum_size=1044464
espino.menu.eesz.4M.build.rfcal_addr=0x3FC000
espino.menu.ip.lm2f=v2 Lower Memory
espino.menu.ip.lm2f.build.lwip_include=lwip2/include
espino.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espino.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espino.menu.ip.hb2f=v2 Higher Bandwidth
espino.menu.ip.hb2f.build.lwip_include=lwip2/include
espino.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espino.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espino.menu.ip.lm2n=v2 Lower Memory (no features)
espino.menu.ip.lm2n.build.lwip_include=lwip2/include
espino.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espino.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espino.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espino.menu.ip.hb2n.build.lwip_include=lwip2/include
espino.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espino.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espino.menu.ip.lm6f=v2 IPv6 Lower Memory
espino.menu.ip.lm6f.build.lwip_include=lwip2/include
espino.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espino.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espino.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espino.menu.ip.hb6f.build.lwip_include=lwip2/include
espino.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espino.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espino.menu.ip.hb1=v1.4 Higher Bandwidth
espino.menu.ip.hb1.build.lwip_lib=-llwip_gcc
espino.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
espino.menu.ip.src=v1.4 Compile from source
espino.menu.ip.src.build.lwip_lib=-llwip_src
espino.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
espino.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espino.menu.dbg.Disabled=Disabled
espino.menu.dbg.Disabled.build.debug_port=
espino.menu.dbg.Serial=Serial
espino.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espino.menu.dbg.Serial1=Serial1
espino.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espino.menu.lvl.None____=None
espino.menu.lvl.None____.build.debug_level=
espino.menu.lvl.SSL=SSL
espino.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espino.menu.lvl.TLS_MEM=TLS_MEM
espino.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espino.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espino.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espino.menu.lvl.HTTP_SERVER=HTTP_SERVER
espino.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espino.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espino.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espino.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espino.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espino.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espino.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espino.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espino.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espino.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espino.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espino.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espino.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.lvl.CORE=CORE
espino.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espino.menu.lvl.WIFI=WIFI
espino.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espino.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espino.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espino.menu.lvl.UPDATER=UPDATER
espino.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espino.menu.lvl.OTA=OTA
espino.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espino.menu.lvl.OOM=OOM
espino.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espino.menu.lvl.MDNS=MDNS
espino.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
espino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espino.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espino.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espino.menu.wipe.none=Only Sketch
espino.menu.wipe.none.upload.erase_cmd=
espino.menu.wipe.sdk=Sketch + WiFi Settings
espino.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espino.menu.wipe.all=All Flash Contents
espino.menu.wipe.all.upload.erase_cmd=erase_flash
espino.menu.baud.115200=115200
espino.menu.baud.115200.upload.speed=115200
espino.menu.baud.57600=57600
espino.menu.baud.57600.upload.speed=57600
espino.menu.baud.230400.linux=230400
espino.menu.baud.230400.macosx=230400
espino.menu.baud.230400.upload.speed=230400
espino.menu.baud.256000.windows=256000
espino.menu.baud.256000.upload.speed=256000
espino.menu.baud.460800.linux=460800
espino.menu.baud.460800.macosx=460800
espino.menu.baud.460800.upload.speed=460800
espino.menu.baud.512000.windows=512000
espino.menu.baud.512000.upload.speed=512000
espino.menu.baud.921600=921600
espino.menu.baud.921600.upload.speed=921600
espino.menu.baud.3000000=3000000
espino.menu.baud.3000000.upload.speed=3000000

