OS-Q/A51/boards.txt
##############################################################
gen4iod.name=4D Systems gen4 IoD Range
gen4iod.build.board=GEN4_IOD
gen4iod.build.f_cpu=160000000L
gen4iod.build.variant=generic
gen4iod.upload.tool=esptool
gen4iod.upload.maximum_data_size=81920
gen4iod.upload.wait_for_upload_port=true
gen4iod.upload.erase_cmd=
gen4iod.serial.disableDTR=true
gen4iod.serial.disableRTS=true
gen4iod.build.mcu=esp8266
gen4iod.build.core=esp8266
gen4iod.build.spiffs_pagesize=256
gen4iod.build.debug_port=
gen4iod.build.debug_level=
gen4iod.menu.xtal.80=80 MHz
gen4iod.menu.xtal.80.build.f_cpu=80000000L
gen4iod.menu.xtal.160=160 MHz
gen4iod.menu.xtal.160.build.f_cpu=160000000L
gen4iod.menu.vt.flash=Flash
gen4iod.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
gen4iod.menu.vt.heap=Heap
gen4iod.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
gen4iod.menu.vt.iram=IRAM
gen4iod.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
gen4iod.menu.exception.legacy=Legacy (new can return nullptr)
gen4iod.menu.exception.legacy.build.exception_flags=-fno-exceptions
gen4iod.menu.exception.legacy.build.stdcpp_lib=-lstdc++
gen4iod.menu.exception.disabled=Disabled (new can abort)
gen4iod.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
gen4iod.menu.exception.disabled.build.stdcpp_lib=-lstdc++
gen4iod.menu.exception.enabled=Enabled
gen4iod.menu.exception.enabled.build.exception_flags=-fexceptions
gen4iod.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
gen4iod.menu.ssl.all=All SSL ciphers (most compatible)
gen4iod.menu.ssl.all.build.sslflags=
gen4iod.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
gen4iod.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
gen4iod.upload.resetmethod=--before default_reset --after hard_reset
gen4iod.menu.FlashMode.dout=DOUT (compatible)
gen4iod.menu.FlashMode.dout.build.flash_mode=dout
gen4iod.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
gen4iod.menu.FlashMode.dio=DIO
gen4iod.menu.FlashMode.dio.build.flash_mode=dio
gen4iod.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
gen4iod.menu.FlashMode.qout=QOUT
gen4iod.menu.FlashMode.qout.build.flash_mode=qout
gen4iod.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
gen4iod.menu.FlashMode.qio=QIO (fast)
gen4iod.menu.FlashMode.qio.build.flash_mode=qio
gen4iod.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
gen4iod.build.flash_freq=80
gen4iod.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
gen4iod.menu.eesz.2M64.build.flash_size=2M
gen4iod.menu.eesz.2M64.build.flash_size_bytes=0x200000
gen4iod.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
gen4iod.menu.eesz.2M64.build.spiffs_pagesize=256
gen4iod.menu.eesz.2M64.upload.maximum_size=1044464
gen4iod.menu.eesz.2M64.build.rfcal_addr=0x1FC000
gen4iod.menu.eesz.2M64.build.spiffs_start=0x1F0000
gen4iod.menu.eesz.2M64.build.spiffs_end=0x1FB000
gen4iod.menu.eesz.2M64.build.spiffs_blocksize=4096
gen4iod.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
gen4iod.menu.eesz.2M128.build.flash_size=2M
gen4iod.menu.eesz.2M128.build.flash_size_bytes=0x200000
gen4iod.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
gen4iod.menu.eesz.2M128.build.spiffs_pagesize=256
gen4iod.menu.eesz.2M128.upload.maximum_size=1044464
gen4iod.menu.eesz.2M128.build.rfcal_addr=0x1FC000
gen4iod.menu.eesz.2M128.build.spiffs_start=0x1E0000
gen4iod.menu.eesz.2M128.build.spiffs_end=0x1FB000
gen4iod.menu.eesz.2M128.build.spiffs_blocksize=4096
gen4iod.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
gen4iod.menu.eesz.2M256.build.flash_size=2M
gen4iod.menu.eesz.2M256.build.flash_size_bytes=0x200000
gen4iod.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
gen4iod.menu.eesz.2M256.build.spiffs_pagesize=256
gen4iod.menu.eesz.2M256.upload.maximum_size=1044464
gen4iod.menu.eesz.2M256.build.rfcal_addr=0x1FC000
gen4iod.menu.eesz.2M256.build.spiffs_start=0x1C0000
gen4iod.menu.eesz.2M256.build.spiffs_end=0x1FB000
gen4iod.menu.eesz.2M256.build.spiffs_blocksize=4096
gen4iod.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
gen4iod.menu.eesz.2M512.build.flash_size=2M
gen4iod.menu.eesz.2M512.build.flash_size_bytes=0x200000
gen4iod.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
gen4iod.menu.eesz.2M512.build.spiffs_pagesize=256
gen4iod.menu.eesz.2M512.upload.maximum_size=1044464
gen4iod.menu.eesz.2M512.build.rfcal_addr=0x1FC000
gen4iod.menu.eesz.2M512.build.spiffs_start=0x180000
gen4iod.menu.eesz.2M512.build.spiffs_end=0x1FA000
gen4iod.menu.eesz.2M512.build.spiffs_blocksize=8192
gen4iod.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
gen4iod.menu.eesz.2M1M.build.flash_size=2M
gen4iod.menu.eesz.2M1M.build.flash_size_bytes=0x200000
gen4iod.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
gen4iod.menu.eesz.2M1M.build.spiffs_pagesize=256
gen4iod.menu.eesz.2M1M.upload.maximum_size=1044464
gen4iod.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
gen4iod.menu.eesz.2M1M.build.spiffs_start=0x100000
gen4iod.menu.eesz.2M1M.build.spiffs_end=0x1FA000
gen4iod.menu.eesz.2M1M.build.spiffs_blocksize=8192
gen4iod.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
gen4iod.menu.eesz.2M.build.flash_size=2M
gen4iod.menu.eesz.2M.build.flash_size_bytes=0x200000
gen4iod.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
gen4iod.menu.eesz.2M.build.spiffs_pagesize=256
gen4iod.menu.eesz.2M.upload.maximum_size=1044464
gen4iod.menu.eesz.2M.build.rfcal_addr=0x1FC000
gen4iod.menu.eesz.512K32=512KB (FS:32KB OTA:~230KB)
gen4iod.menu.eesz.512K32.build.flash_size=512K
gen4iod.menu.eesz.512K32.build.flash_size_bytes=0x80000
gen4iod.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
gen4iod.menu.eesz.512K32.build.spiffs_pagesize=256
gen4iod.menu.eesz.512K32.upload.maximum_size=466928
gen4iod.menu.eesz.512K32.build.rfcal_addr=0x7C000
gen4iod.menu.eesz.512K32.build.spiffs_start=0x73000
gen4iod.menu.eesz.512K32.build.spiffs_end=0x7B000
gen4iod.menu.eesz.512K32.build.spiffs_blocksize=4096
gen4iod.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
gen4iod.menu.eesz.512K64.build.flash_size=512K
gen4iod.menu.eesz.512K64.build.flash_size_bytes=0x80000
gen4iod.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
gen4iod.menu.eesz.512K64.build.spiffs_pagesize=256
gen4iod.menu.eesz.512K64.upload.maximum_size=434160
gen4iod.menu.eesz.512K64.build.rfcal_addr=0x7C000
gen4iod.menu.eesz.512K64.build.spiffs_start=0x6B000
gen4iod.menu.eesz.512K64.build.spiffs_end=0x7B000
gen4iod.menu.eesz.512K64.build.spiffs_blocksize=4096
gen4iod.menu.eesz.512K128=512KB (FS:128KB OTA:~182KB)
gen4iod.menu.eesz.512K128.build.flash_size=512K
gen4iod.menu.eesz.512K128.build.flash_size_bytes=0x80000
gen4iod.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
gen4iod.menu.eesz.512K128.build.spiffs_pagesize=256
gen4iod.menu.eesz.512K128.upload.maximum_size=368624
gen4iod.menu.eesz.512K128.build.rfcal_addr=0x7C000
gen4iod.menu.eesz.512K128.build.spiffs_start=0x5B000
gen4iod.menu.eesz.512K128.build.spiffs_end=0x7B000
gen4iod.menu.eesz.512K128.build.spiffs_blocksize=4096
gen4iod.menu.eesz.512K=512KB (FS:none OTA:~246KB)
gen4iod.menu.eesz.512K.build.flash_size=512K
gen4iod.menu.eesz.512K.build.flash_size_bytes=0x80000
gen4iod.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
gen4iod.menu.eesz.512K.build.spiffs_pagesize=256
gen4iod.menu.eesz.512K.upload.maximum_size=499696
gen4iod.menu.eesz.512K.build.rfcal_addr=0x7C000
gen4iod.menu.ip.lm2f=v2 Lower Memory
gen4iod.menu.ip.lm2f.build.lwip_include=lwip2/include
gen4iod.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
gen4iod.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
gen4iod.menu.ip.hb2f=v2 Higher Bandwidth
gen4iod.menu.ip.hb2f.build.lwip_include=lwip2/include
gen4iod.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
gen4iod.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
gen4iod.menu.ip.lm2n=v2 Lower Memory (no features)
gen4iod.menu.ip.lm2n.build.lwip_include=lwip2/include
gen4iod.menu.ip.lm2n.build.lwip_lib=-llwip2-536
gen4iod.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
gen4iod.menu.ip.hb2n=v2 Higher Bandwidth (no features)
gen4iod.menu.ip.hb2n.build.lwip_include=lwip2/include
gen4iod.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
gen4iod.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
gen4iod.menu.ip.lm6f=v2 IPv6 Lower Memory
gen4iod.menu.ip.lm6f.build.lwip_include=lwip2/include
gen4iod.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
gen4iod.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
gen4iod.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
gen4iod.menu.ip.hb6f.build.lwip_include=lwip2/include
gen4iod.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
gen4iod.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
gen4iod.menu.ip.hb1=v1.4 Higher Bandwidth
gen4iod.menu.ip.hb1.build.lwip_lib=-llwip_gcc
gen4iod.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
gen4iod.menu.ip.src=v1.4 Compile from source
gen4iod.menu.ip.src.build.lwip_lib=-llwip_src
gen4iod.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
gen4iod.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
gen4iod.menu.dbg.Disabled=Disabled
gen4iod.menu.dbg.Disabled.build.debug_port=
gen4iod.menu.dbg.Serial=Serial
gen4iod.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
gen4iod.menu.dbg.Serial1=Serial1
gen4iod.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
gen4iod.menu.lvl.None____=None
gen4iod.menu.lvl.None____.build.debug_level=
gen4iod.menu.lvl.SSL=SSL
gen4iod.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
gen4iod.menu.lvl.TLS_MEM=TLS_MEM
gen4iod.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
gen4iod.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
gen4iod.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
gen4iod.menu.lvl.HTTP_SERVER=HTTP_SERVER
gen4iod.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
gen4iod.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
gen4iod.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
gen4iod.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
gen4iod.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
gen4iod.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
gen4iod.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
gen4iod.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
gen4iod.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
gen4iod.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
gen4iod.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
gen4iod.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
gen4iod.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
gen4iod.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
gen4iod.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
gen4iod.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
gen4iod.menu.lvl.CORE=CORE
gen4iod.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
gen4iod.menu.lvl.WIFI=WIFI
gen4iod.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
gen4iod.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
gen4iod.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
gen4iod.menu.lvl.UPDATER=UPDATER
gen4iod.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
gen4iod.menu.lvl.OTA=OTA
gen4iod.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
gen4iod.menu.lvl.OOM=OOM
gen4iod.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
gen4iod.menu.lvl.MDNS=MDNS
gen4iod.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
gen4iod.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
gen4iod.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
gen4iod.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
gen4iod.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
gen4iod.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
gen4iod.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
gen4iod.menu.wipe.none=Only Sketch
gen4iod.menu.wipe.none.upload.erase_cmd=
gen4iod.menu.wipe.sdk=Sketch + WiFi Settings
gen4iod.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
gen4iod.menu.wipe.all=All Flash Contents
gen4iod.menu.wipe.all.upload.erase_cmd=erase_flash
gen4iod.menu.baud.115200=115200
gen4iod.menu.baud.115200.upload.speed=115200
gen4iod.menu.baud.57600=57600
gen4iod.menu.baud.57600.upload.speed=57600
gen4iod.menu.baud.230400.linux=230400
gen4iod.menu.baud.230400.macosx=230400
gen4iod.menu.baud.230400.upload.speed=230400
gen4iod.menu.baud.256000.windows=256000
gen4iod.menu.baud.256000.upload.speed=256000
gen4iod.menu.baud.460800.linux=460800
gen4iod.menu.baud.460800.macosx=460800
gen4iod.menu.baud.460800.upload.speed=460800
gen4iod.menu.baud.512000.windows=512000
gen4iod.menu.baud.512000.upload.speed=512000
gen4iod.menu.baud.921600=921600
gen4iod.menu.baud.921600.upload.speed=921600
gen4iod.menu.baud.3000000=3000000
gen4iod.menu.baud.3000000.upload.speed=3000000


